Lab1: Write a Pandas program to create a Pivot table and find the total sale
amount region wise, manager wise, sales man wise.

In [27]:
import pandas as pd
import numpy as np

In [28]:
#read_csv()- read csv file into dataframe
df=pd.read_csv("salesdata.csv")
print(df.head())

    Region  Manager   SalesMan          Item  Units  Unit_price  Sale_amt
0     East   Martha  Alexander    Television     95      1198.0  113810.0
1  Central  Hermann     Shelli  Home Theater     50       500.0   25000.0
2  Central  Hermann       Luis    Television     36      1198.0   43128.0
3  Central  Timothy      David    Cell Phone     27       225.0    6075.0
4     West  Timothy    Stephen    Television     56      1198.0   67088.0

In [29]:
#create pivot table for showing total sales amount, based on region wise, manager wise and salesman wise.
region_manager_salesman_pivot=pd.pivot_table(df,index=['Region','Manager','SalesMan'],values=['Sale_amt'],
                                             aggfunc=['sum'])
print(region_manager_salesman_pivot)

                                sum
                           Sale_amt
Region  Manager SalesMan
Central Douglas John       124016.0
        Hermann Luis       206373.0
                Shelli      33698.0
                Sigal      125037.5
        Marth   Steven      14000.0
        Martha  Steven     185690.0
        Timothy David      140955.0
East    Douglas Karen       48204.0
        Martha  Alexander  236703.0
                Diana       36100.0
West    Douglas Michael     66836.0
        Timothy Stephen     88063.0

In [30]:
df.head()

    Region  Manager   SalesMan          Item  Units  Unit_price  Sale_amt
0     East   Martha  Alexander    Television     95      1198.0  113810.0
1  Central  Hermann     Shelli  Home Theater     50       500.0   25000.0
2  Central  Hermann       Luis    Television     36      1198.0   43128.0
3  Central  Timothy      David    Cell Phone     27       225.0    6075.0
4     West  Timothy    Stephen    Television     56      1198.0   67088.0

In [31]:
region_wise_pivot=pd.pivot_table(df,index=['Region'],values=['Sale_amt'],aggfunc=['sum'])
print(region_wise_pivot)

              sum
         Sale_amt
Region
Central  829769.5
East     321007.0
West     154899.0

In [32]:
manager_wise_pivot=pd.pivot_table(df,index=['Manager'],values=['Sale_amt'],aggfunc=['sum'])
print(manager_wise_pivot)

              sum
         Sale_amt
Manager
Douglas  239056.0
Hermann  365108.5
Marth     14000.0
Martha   458493.0
Timothy  229018.0

In [33]:
salesman_wise_pivot=pd.pivot_table(df,index=['SalesMan'],values=['Sale_amt'],aggfunc=['sum'])
print(salesman_wise_pivot)

                sum
           Sale_amt
SalesMan
Alexander  236703.0
David      140955.0
Diana       36100.0
John       124016.0
Karen       48204.0
Luis       206373.0
Michael     66836.0
Shelli      33698.0
Sigal      125037.5
Stephen     88063.0
Steven     199690.0